In [29]:
import pandas as pd
from sklearn.preprocessing import OneHotEncoder

In [30]:
df=pd.DataFrame({
    'color':['red','blue','green','green','red','blue']
})

In [31]:
df.head()

   color
0    red
1   blue
2  green
3  green
4    red

In [32]:
encoder=OneHotEncoder()

In [33]:
encoded=encoder.fit_transform(df[['color']]).toarray()

In [34]:
encoded_df=pd.DataFrame(encoded,columns=encoder.get_feature_names_out())

In [35]:
encoded_df

   color_blue  color_green  color_red
0         0.0          0.0        1.0
1         1.0          0.0        0.0
2         0.0          1.0        0.0
3         0.0          1.0        0.0
4         0.0          0.0        1.0
5         1.0          0.0        0.0

In [36]:
pd.concat([df,encoded_df],axis=1)

   color  color_blue  color_green  color_red
0    red         0.0          0.0        1.0
1   blue         1.0          0.0        0.0
2  green         0.0          1.0        0.0
3  green         0.0          1.0        0.0
4    red         0.0          0.0        1.0
5   blue         1.0          0.0        0.0

In [37]:
from sklearn.preprocessing import LabelEncoder

In [38]:
lbl_encoder=LabelEncoder()

In [ ]:
lbl_encoder.fit_transform(df[['color']])

array([2, 0, 1, 1, 2, 0])

In [41]:
lbl_encoder.transform([['red']])

/Users/vishalmahto/Desktop/ML/venv/lib/python3.12/site-packages/sklearn/preprocessing/_label.py:129: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, dtype=self.classes_.dtype, warn=True)

array([2])

In [42]:
lbl_encoder.transform([['blue']])

/Users/vishalmahto/Desktop/ML/venv/lib/python3.12/site-packages/sklearn/preprocessing/_label.py:129: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, dtype=self.classes_.dtype, warn=True)

array([0])

In [43]:
lbl_encoder.transform([['green']])

/Users/vishalmahto/Desktop/ML/venv/lib/python3.12/site-packages/sklearn/preprocessing/_label.py:129: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, dtype=self.classes_.dtype, warn=True)

array([1])

Ordinal encoding

In [44]:
from sklearn.preprocessing import OrdinalEncoder

In [45]:
df=pd.DataFrame({
    'size':['small','medium','large','medium','small','large']
})

In [46]:
df

     size
0   small
1  medium
2   large
3  medium
4   small
5   large

In [47]:
encoder=OrdinalEncoder(categories=[['small','medium','large']])

In [48]:
encoder.fit_transform(df[['size']])

array([[0.],
       [1.],
       [2.],
       [1.],
       [0.],
       [2.]])

In [49]:
import pandas as pd

data = {
    "city": ["Delhi", "Mumbai", "Kolkata", "Delhi", "Mumbai"],
    "price": [1200, 1500, 1100, 1300, 1600]
}

df = pd.DataFrame(data)

In [50]:
mean_price=df.groupby('city')['price'].mean().to_dict()

In [51]:
mean_price

{'Delhi': 1250.0, 'Kolkata': 1100.0, 'Mumbai': 1550.0}

In [ ]:
df['encoded_city']=df['city'].map(mean_price)

In [53]:
df[['price','encoded_city']]

   price  encoded_city
0   1200        1250.0
1   1500        1550.0
2   1100        1100.0
3   1300        1250.0
4   1600        1550.0

In [54]:
import seaborn as sns

In [55]:
sns.load_dataset('tips')

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]